20211202160856-org_mode_is_superior_to_jupyter_notebooks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-22 Thu 06:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-mode is superior to Jupyter notebooks</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Org-mode is superior to Jupyter notebooks</h1>
<dl class="org-dl">
<dt>tags</dt><dd><a href="20220105150821-workflow.html#ID-15a9ee78-16e4-4df9-b01b-60ef4cbe0a44">Workflow</a></dd>
</dl>

<p>
(for me, and probably for you too if you're reading this!)
</p>

<div id="outline-container-org4c250f0" class="outline-2">
<h2 id="org4c250f0">It is superior</h2>
<div class="outline-text-2" id="text-org4c250f0">
<ul class="org-ul">
<li>We can get the same functionalities (besides widget) with the appropriate configuration</li>
<li>I am in a real text editor</li>
<li>I can connect to kernel in a REPL and explore its state</li>
<li>I can copy code from other places on my HD</li>
<li>I have access to my emails</li>
<li>Easier to navigate within the document itself. I typically use a single org file when I would have needed several jupyter notebooks;</li>
<li>Export in other formats is easy and highly customizable.</li>
<li>I can combine several languages in the same document (mainly shell and sqlite)</li>
<li>You can <b>version control</b> your org files!</li>
</ul>
</div>
</div>

<div id="outline-container-orgf156217" class="outline-2">
<h2 id="orgf156217">But not perfect</h2>
<div class="outline-text-2" id="text-orgf156217">
<ul class="org-ul">
<li>Few people know and want to learn emacs which has a steep learning curve; working with others can be a challenge;</li>
<li>The figures are not saved with the document (reason why they play nice with version control), <i>but</i> we can easily export the org document to pdf for review.</li>
</ul>
</div>
</div>

<div id="outline-container-org883e3e3" class="outline-2">
<h2 id="org883e3e3">Links to this note</h2>
</div>
</div>
</body>
</html>